---
title: StructuralSection
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 24
---

# StructuralSection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructuralSectionAnalysisParams AnalysisParams { get; }` | `structuralSection.AnalysisParams` | StructuralSectionAnalysisParams |
| `Double ElasticModulusStrongAxis { get; set; }` | `structuralSection.ElasticModulusStrongAxis` | Double |
| `Double ElasticModulusWeakAxis { get; set; }` | `structuralSection.ElasticModulusWeakAxis` | Double |
| `Boolean IsValidObject { get; }` | `structuralSection.IsValidObject` | Boolean |
| `Double MomentOfInertiaStrongAxis { get; set; }` | `structuralSection.MomentOfInertiaStrongAxis` | Double |
| `Double MomentOfInertiaWeakAxis { get; set; }` | `structuralSection.MomentOfInertiaWeakAxis` | Double |
| `Double NominalWeight { get; set; }` | `structuralSection.NominalWeight` | Double |
| `Double Perimeter { get; set; }` | `structuralSection.Perimeter` | Double |
| `Double PlasticModulusStrongAxis { get; set; }` | `structuralSection.PlasticModulusStrongAxis` | Double |
| `Double PlasticModulusWeakAxis { get; set; }` | `structuralSection.PlasticModulusWeakAxis` | Double |
| `Double PrincipalAxesAngle { get; set; }` | `structuralSection.PrincipalAxesAngle` | Double |
| `Double SectionArea { get; set; }` | `structuralSection.SectionArea` | Double |
| `String SectionNameKey { get; set; }` | `structuralSection.SectionNameKey` | String |
| `Double ShearAreaStrongAxis { get; set; }` | `structuralSection.ShearAreaStrongAxis` | Double |
| `Double ShearAreaWeakAxis { get; set; }` | `structuralSection.ShearAreaWeakAxis` | Double |
| `StructuralSectionGeneralShape StructuralSectionGeneralShape { get; }` | `structuralSection.StructuralSectionGeneralShape` | StructuralSectionGeneralShape |
| `StructuralSectionShape StructuralSectionShape { get; }` | `structuralSection.StructuralSectionShape` | StructuralSectionShape |
| `String StructuralSectionShapeName { get; }` | `structuralSection.StructuralSectionShapeName` | String |
| `Double TorsionalModulus { get; set; }` | `structuralSection.TorsionalModulus` | Double |
| `Double TorsionalMomentOfInertia { get; set; }` | `structuralSection.TorsionalMomentOfInertia` | Double |
| `Double WarpingConstant { get; set; }` | `structuralSection.WarpingConstant` | Double |
| `Void Dispose()` | `structuralSection.Dispose()` | Void |
| `UV GetBoundarySize()` | `structuralSection.GetBoundarySize()` | UV |
| `IEnumerator GetEnumerator()` | `structuralSection.GetEnumerator()` | IEnumerator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```